04_Cylinder_2D_AMR/CylinderAMR/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    "(rho|rhoU|rhoE)"
    {
        solver          diagonal;
    }

    p
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.1;

        smoother         GaussSeidel;
        directSolveCoarsest false;
        agglomerator faceAreaPair;
        mergeLevels      1;
        nCellsInCoarsestLevel 256;

        maxIter          1000;
        nPreSweeps       0;
        nPostSweeps      2;
        nFinestSweeps    2;
    };

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        nSweeps         1;
        tolerance       1e-7;
        relTol          0.1;
    };
    
    h
    {
	$U
	tolerance       1e-8;
	relTol          0;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors 1;
    nCorrectors     3;
    nNonOrthogonalCorrectors 2;
}

relaxationFactors
{
    equations
    {
        ".*" 1;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //

